Cylinder for foam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        nFaces          19360;
        startFace       19140;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          88;
        startFace       38500;
    }
    cylinderWalls
    {
        type            patch;
        physicalType    patch;
        nFaces          176;
        startFace       38588;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          88;
        startFace       38764;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          44;
        startFace       38852;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          44;
        startFace       38896;
    }
)

// ************************************************************************* //
